[SpecOps X2SoldierClassTemplate]
+DisplayName="SpecOps"
+ClassSummary="SpecOps a highly trained special forces veterans that focus on guerilla warfare and hit and run tactics."
+LeftAbilityTreeTitle="Covert Ops"
+RightAbilityTreeTitle="Guerilla Warfare"
AbilityTreeTitles[0]="Covert Ops"
AbilityTreeTitles[1]="Designated Marksman"
AbilityTreeTitles[2]="Guerilla Warfare"

+RandomNickNames[0]="Deadstroke"
+RandomNickNames[1]="Bloodslinger"
+RandomNickNames[2]="Bloodmoon"
+RandomNickNames[3]="Silentstreak"
+RandomNickNames[4]="Redscar"
+RandomNickNames[5]="Ironfall"
+RandomNickNames[6]="Echo"
+RandomNickNames[7]="Whisper"
+RandomNickNames[8]="Teardrop"
+RandomNickNames[9]="Heavy Duty"
+RandomNickNames[10]="Last Sight"
+RandomNickNames[11]="Last Shadow"
+RandomNickNames[12]="Blaze"
+RandomNickNames[13]="Red Dawn"
+RandomNickNames[14]="Silver"
+RandomNickNames[15]="Wraith"
+RandomNickNames[16]="Recon"
+RandomNickNames[17]="Ace"
+RandomNickNames[18]="Spooky"
+RandomNickNames[19]="Joker"
+RandomNickNames[20]="Mastermind"
+RandomNickNames[21]="Sergeant"
+RandomNickNames[22]="Teflon"
+RandomNickNames[23]="K.I.A."
+RandomNickNames[24]="Weasel"
+RandomNickNames[25]="Texas"
+RandomNickNames[26]="Desperado"
+RandomNickNames[27]="Hotshot"
+RandomNickNames[28]="Snake"
+RandomNickNames[29]="Animal Mother"
+RandomNickNames[30]="Crazy Eyes"
+RandomNickNames[31]="Speznas"
+RandomNickNames[32]="Ayyhunt"

[SpecOpsFlashbang X2GrenadeTemplate]
FriendlyName="SpecOps Flashbang"
FriendlyNamePlural="SpecOps Flashbangs"
BriefSummary="The Flashbang Grenade disorients and maybe even stuns enemies in a small radius, inflicting significant offensive penalties."
TacticalText="<Bullet/> SpecOps Flashbang don't do damage, but disorient and maybe stuns enemies in a small radius.<br/><Bullet/> Friendly squad members will not be affected."
ThrownAbilityName="Throw SpecOps Flashbang"
ThrownAbilityHelpText="Disorient and chance to stun all hostile targets in the affected area."
LaunchedAbilityname="Launch SpecOps Flashbang"
LaunchedAbilityHelpText="Disorient and maybe stuns all hostile targets in the affected area."

[GTSMusashiRecon X2SoldierAbilityUnlockTemplate]
DisplayName="Spec Ops: Recon"
Summary="Your SpecOps soldiers are recon specialists behind enemy lines. They have 30% less detection radius and gain +2 sight radius."

[GTSMusashiBandOfBrothers X2SoldierAbilityUnlockTemplate]
DisplayName="Spec Ops: Band of Brothers"
Summary="Knocking out targets, picking up or dropping bodies does not cost an action point and do not end your turn."

[MusashiStealthTactics X2AbilityTemplate]
LocFriendlyName="Stealth Tactics"
LocLongDescription="If you see no enemy at the beginning of your turn you enter concealment."
LocHelpText="<Bullet/>If you see no enemy at the beginning of your turn you enter concealment."
LocFlyOverText="StealthTactics" 
LocPromotionPopupText="If you see no enemy for at the beginning of your turn you enter concealment."

[MusashiDemolitionExpert X2AbilityTemplate]
LocFriendlyName="Demolition Expert"
LocLongDescription="The demolition experts sets up charges for situations where a little 'distraction' is needed. Blows up all explosive devices (cars, gas tanks, etc.) in <Ability:DEMOLITON_EXPERT_TILE_RADIUS> tile radius. If possible the soldier enters concealment."
LocHelpText="Blows up all explosive devices (cars, gas tanks, etc.) in <Ability:DEMOLITON_EXPERT_TILE_RADIUS> tile radius. If possible the soldier enters concealment."
LocFlyOverText="Demolition Expert"
LocPromotionPopupText="<Bullet/>Blows up all explosive devices (cars, gas tanks, etc.) in <Ability:DEMOLITON_EXPERT_TILE_RADIUS> tile radius. If possible the soldier enters concealment.<br/><Bullet/>1 charge<br/>"

[MusashiEvasion X2AbilityTemplate]
LocFriendlyName="Decoy"
LocLongDescription="When your concealment is broken for the first time you spawn a mimic beacon at a random location in 5 tile radius to your location."
LocHelpText="When your concealment is broken for the first time you spawn a mimic beacon at a random tile in 5 tile radius to your location."
LocFlyOverText="Decoy"
LocPromotionPopupText="<Bullet/>When your concealment is broken for the first time you spawn a mimic beacon at a random location in 5 tile radius to your location.<br/>"

[MusashiGTSBandOfBrothers X2AbilityTemplate]
LocFriendlyName="Band of Brothers"
LocLongDescription="Knocking out targets, picking up or dropping bodies does not cost an action point and do not end your turn."
LocHelpText="Knocking out targets, picking up or dropping bodies does not cost an action point and do not end your turn."
LocFlyOverText="Band of Brothers"
LocPromotionPopupText="<Bullet/>Knocking out targets, picking up or dropping bodies does not cost an action point and do not end your turn.<br/>"

[MusashiGTSRecon X2AbilityTemplate]
LocFriendlyName="Recon"
LocLongDescription="Your SpecOps soldiers are recon specialists behind enemy lines. 30% less detection radius and +2 sight radius."
LocHelpText="30% less detection radius and +2 sight radius."
LocFlyOverText="Recon"
LocPromotionPopupText="<Bullet/>Your SpecOps soldiers are recon specialists behind enemy lines. 30% less detection radius and +2 sight radius.<br/>"

[MusashiAggression X2AbilityTemplate]
LocFriendlyName="Aggression"
LocLongDescription="All of your attacks get +5 Crit chance for each enemy you can see, to a max of +30."
LocHelpText="All of your attacks get +5 Crit chance for each enemy you can see, to a max of +30."
LocFlyOverText="Aggression"
LocPromotionPopupText="<Bullet/> Aggression even affects attacks that can't normally crit, such as grenades. <br/>"

[MusashiFlashBang X2AbilityTemplate]
LocFriendlyName="SpecOps Flashbang"
LocLongDescription="The SpecOps version of the flash grenade packs a bigger punch at the expense of detonation radius. <br/>It disorients enemies and has a 30% stun chance. <br/>The usage does not break your concealment and in combination with aggression it also does some damage on critical hits."
LocFlyOverText="SpecOps Flashbang"
LocHelpText="The SpecOps Version of the Flash Grenade packs a bigger punch at the expense of detonation radius"
LocPromotionPopupText="<bullet/>Disorient emenies<br/><bullet/>30% to stun enemies<br/><bullet/>Does not break concealment<br/><bullet/>In combination with Agression does damage on critical hits<br/><bullet/>Has <Ability:Charges/> charges<br/>"

[MusashiCyberWarfare X2AbilityTemplate]
LocFriendlyName="Cyber Warfare"
LocLongDescription="Specializing in cyber warfare you get +30 hacking"
LocHelpText="Specializing in cyber warfare you get +30 hacking"
LocFlyOverText="Cyber Warfare"
LocPromotionPopupText="<Bullet/>Specializing in cyber warfare you get +30 hacking<br/>"

[MusashiMarksman X2AbilityTemplate]
LocFriendlyName="Marksman"
LocLongDescription="Provides limited Squadsight of 4 tiles beyond your sight radius to your primary weapon"
LocHelpText="Provides limited Squadsight of 4 tiles beyond your sight radius to your primary weapon"
LocFlyOverText="Marksman"
LocPromotionPopupText="<Bullet/>Provides limited Squadsight of 4 tiles beyond your sight radius to your primary weapon<br/><Bullet/>Also grants squadsight overwatch with the same range<br/>"

[MusashiMarksmanOverwatch X2AbilityTemplate]
LocFriendlyName="Marksman Long Watch"
LocFriendlyNameWhenConcealed="Marksman Long Watch (Concealed)"
LocHelpText="Fire on the first enemy that moves within your line of sight, with a penalty to aim. Provides limited Squadsight of 4 tiles beyond your sight radius"
LocLongDescription="Fire on the first enemy that moves within your line of sight, but only if revealed. Provides limited Squadsight of 4 tiles beyond your sight radius"
LocLongDescriptionWhenConcealed="Fire on the first enemy that moves within your line of sight, but only if revealed. Provides limited Squadsight of 4 tiles beyond your sight radius"
LocFlyOverText="Marksman Long Watch"

[SpecialForceTraining X2AbilityTemplate]
LocFriendlyName="Special Forces Training"
LocHelpText="Special training allows to fire a sniper rifle with a single action."
LocLongDescription="Special training allows to fire a sniper rifle with a single action."
LocFlyOverText="Special Forces Training"

